PiBoxY/msp430ware/pmbuslib/src/pmbuslib/pmbus.c
/*! SMBus Master Struct  */
static SMBus SMB;

void PMBus_init(uint16_t i2cAddr,
                uint32_t busClk)
{
    // Initialize SMBus Master
    SMBus_masterInit(&SMB,i2cAddr, busClk);
    // Enable SMBus Interrupts, after initializing I2C
    SMBus_masterEnableInt(&SMB);
}

void PMBus_processInt()
{
    // Process SMBus ISR as Master, store result flags
    // Note that the Master starts transfers in Main loop and this function
    // handles the SMBus State machine. The main loop just waits for completion
    SMBus_State sSMBState = SMBus_masterProcessInt(&SMB);
}

#ifdef __MSP430_HAS_USCI__
void PMBus_processTimeoutInt()
{
    // Call the SMBUS function to handle a timeout error and restart the SMBUS
    SMBus_State sSMBState = SMBus_masterProcessTimeoutInt(&SMB);
}

#endif

void PMBus_enablePEC()
{
    SMBus_enablePEC(&SMB);
}

void PMBus_disablePEC()
{
    SMBus_disablePEC(&SMB);
}

int8_t PMBus_cmdRead(uint8_t slaveAddress,
                     uint8_t commandId,
                     uint8_t* rxData,
                     uint8_t* rxSize,
                     uint32_t timeout)
{
    // Make sure commandId is in range
    if(commandId >= sizeof(PMBus_Commands) / sizeof(PMBus_Commands[0]))
    {
        return(PMBUS_RET_ERROR);
    }
    int8_t ret = PMBUS_RET_ERROR;
    uint8_t transaction = (PMBus_Commands[commandId] & 0x0F);
    switch(transaction)
    {
    case PMB_NO_READ:
        ret = PMBUS_RET_OK;
        break;
    case PMB_READ_BYTE:
        ret = PMBus_cmdReadByte(slaveAddress,
                                commandId,
                                rxData,
                                timeout);
        *rxSize = 1;
        break;
    case PMB_READ_WORD:
        ret = PMBus_cmdReadWord(slaveAddress,
                                commandId,
                                rxData,
                                timeout);
        *rxSize = 2;
        break;
    case PMB_BLOCK_READ:
        ret = PMBus_cmdBlockRead(slaveAddress,
                                 commandId,
                                 rxData,
                                 rxSize,
                                 timeout);
        break;
    case PMB_RESERVED:
    default:
        ret = PMBUS_RET_ERROR;
    }
    return(ret);
}

int8_t PMBus_cmdWrite(uint8_t slaveAddress,
                      uint8_t commandId,
                      uint8_t* txData,
                      uint8_t txSize,
                      uint32_t timeout)
{
    // Make sure commandId is in range
    if(commandId >= sizeof(PMBus_Commands) / sizeof(PMBus_Commands[0]))
    {
        return(PMBUS_RET_ERROR);
    }
    uint8_t transaction = (PMBus_Commands[commandId] & 0xF0);

    int8_t ret = PMBUS_RET_ERROR;
    switch(transaction)
    {
    case PMB_NO_WRITE:
        ret = PMBUS_RET_OK;
        break;
    case PMB_SEND_BYTE:
        if(txSize != 0)
        {
            return (PMBUS_RET_ERROR);
        }
        ret = PMBus_cmdSendByte(slaveAddress,
                                commandId,
                                timeout);
        break;
    case PMB_WRITE_BYTE:
        if(txSize != 1)
        {
            return (PMBUS_RET_ERROR);
        }
        ret = PMBus_cmdWriteByte(slaveAddress,
                                 commandId,
                                 txData,
                                 timeout);
        break;
    case PMB_WRITE_WORD:
        if(txSize != 2)
        {
            return (PMBUS_RET_ERROR);
        }
        ret = PMBus_cmdWriteWord(slaveAddress,
                                 commandId,
                                 txData,
                                 timeout);
        break;
    case PMB_BLOCK_WRITE:
        ret = PMBus_cmdBlockWrite(slaveAddress,
                                  commandId,
                                  txData,
                                  txSize,
                                  timeout);
        break;
    case PMB_RESERVED:
    default:
        ret = PMBUS_RET_ERROR;
    }
    return(ret);
}

int8_t PMBus_cmdSendByte(uint8_t slaveAddress,
                         uint8_t commandByte,
                         uint32_t timeout)
{
    if(SMBus_masterSendByte(&SMB,                          // SMB struct
                            slaveAddress,                  // Slave Addr
                            commandByte) != PMBUS_RET_OK)  // PMB Command
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdWriteByte(uint8_t slaveAddress,
                          uint8_t commandByte,
                          uint8_t* txData,
                          uint32_t timeout)
{
    if(SMBus_masterWriteByteWord(&SMB,               // SMB struct
                                 slaveAddress,       // Slave Addr
                                 commandByte,        // PMB Command
                                 txData,             // DataPtr
                                 1) != PMBUS_RET_OK) // 1 byte data
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdWriteWord(uint8_t slaveAddress,
                          uint8_t commandByte,
                          uint8_t* txData,
                          uint32_t timeout)
{
    if(SMBus_masterWriteByteWord(&SMB,                  // SMB struct
                                 slaveAddress,          // Slave Addr
                                 commandByte,           // PMB Command
                                 txData,                // DataPtr
                                 2) != PMBUS_RET_OK)    // 2 bytes data
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdBlockWrite(uint8_t slaveAddress,
                           uint8_t commandByte,
                           uint8_t* txData,
                           uint8_t txSize,
                           uint32_t timeout)
{
    if(SMBus_masterWriteBlock(&SMB,                       // SMB struct
                              slaveAddress,               // Slave Addr
                              commandByte,                // PMB Command
                              txData,                     // Data ptr
                              txSize) != PMBUS_RET_OK)    // number of bytes
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdReceiveByte(uint8_t slaveAddress,
                            uint8_t* rxData,
                            uint32_t timeout)
{
    if(SMBus_masterReceiveByte(&SMB,                      // SMB struct
                               slaveAddress,              // Slave Addr
                               rxData) != PMBUS_RET_OK)   // DataPtr
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Get the length of payload for response
    if(SMBus_getRxPayloadAvailable(&SMB) != 1)
    {
        return(PMBUS_RET_ERROR);  // RX Data size Error
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdReadByte(uint8_t slaveAddress,
                         uint8_t commandByte,
                         uint8_t* rxData,
                         uint32_t timeout)
{
    if(SMBus_masterReadByteWord(&SMB,                      // SMB struct
                                slaveAddress,              // Slave Addr
                                commandByte,               // PMB Command
                                rxData,                    // DataPtr
                                1) != PMBUS_RET_OK)        // 1 byte data
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Get the length of payload for response
    if(SMBus_getRxPayloadAvailable(&SMB) != 1)
    {
        return(PMBUS_RET_ERROR);  // RX Data size Error
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdReadWord(uint8_t slaveAddress,
                         uint8_t commandByte,
                         uint8_t* rxData,
                         uint32_t timeout)
{
    if(SMBus_masterReadByteWord(&SMB,                      // SMB struct
                                slaveAddress,              // Slave Addr
                                commandByte,               // PMB Command
                                rxData,                    // DataPtr
                                2) != PMBUS_RET_OK)        // 2 byte data
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Get the length of payload for response
    if(SMBus_getRxPayloadAvailable(&SMB) != 2)
    {
        return(PMBUS_RET_ERROR); // RX Data size Error
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdBlockRead(uint8_t slaveAddress,
                          uint8_t commandByte,
                          uint8_t* rxData,
                          uint8_t* rxSize,
                          uint32_t timeout)
{
    if(SMBus_masterReadBlock(&SMB,                            // SMB struct
                             slaveAddress,                    // Slave Addr
                             commandByte,                     // PMB Command
                             rxData) != PMBUS_RET_OK)         // DataPtr
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Return the number of bytes received
    *rxSize = SMBus_getRxPayloadAvailable(&SMB);

    return(PMBUS_RET_OK);
}

