PiBoxY/msp430ware/pmbuslib/src/pmbuslib/pmbus.c
int8_t PMBus_cmdProcessCall(uint8_t slaveAddress,
                            uint8_t commandByte,
                            uint8_t* txData,
                            uint8_t* rxData,
                            uint32_t timeout)
{
    if(SMBus_masterProcessCall(&SMB,                      // SMB struct
                               slaveAddress,              // Slave Addr
                               commandByte,               // PMB Command
                               txData,                    // Tx data
                               rxData) != PMBUS_RET_OK)   // DataPtr
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Get the length of payload for response
    if(SMBus_getRxPayloadAvailable(&SMB) != 2)
    {
        return(PMBUS_RET_ERROR); // RX Data size Error
    }

    return(PMBUS_RET_OK);
}

int8_t PMBus_cmdBlockWriteBlockReadProcessCall(uint8_t slaveAddress,
                                               uint8_t commandByte,
                                               uint8_t* txData,
                                               uint8_t txSize,
                                               uint8_t* rxData,
                                               uint8_t* rxSize,
                                               uint32_t timeout)
{
    if(SMBus_masterProcessCallBlock(&SMB,                         // SMB struct
                                    slaveAddress,                 // Slave Addr
                                    commandByte,                  // PMB Command
                                    txData,                       // Tx data
                                    txSize,                       // Tx data size
                                    rxData) != PMBUS_RET_OK)      // DataPtr
    {
        return(PMBUS_RET_ERROR);
    }

    if((SMBus_masterWaitUntilDone(&SMB,timeout) != PMBUS_RET_OK) ||
       (SMBus_getState(&SMB) != SMBus_State_OK))
    {
        SMBus_masterReset(&SMB); // Force a reset, so we can retry later
        return(PMBUS_RET_ERROR);
    }

    // Return the number of bytes received
    *rxSize = SMBus_getRxPayloadAvailable(&SMB);

    return(PMBUS_RET_OK);
}

int8_t PMBus_ReceiveByteARA(uint8_t *rxData,
                            uint32_t timeout)
{
    return(PMBus_cmdReceiveByte(PMBUS_ARA, rxData, timeout));
}
